## Датасет собран из базы данных переписи 1994 года и содержит данные о доходах.
### Информация о данных:
* age: continuous.
* workclass: Private, Self-emp-not-inc, Self-emp-inc, Federal-gov, Local-gov, State-gov, Without-pay, Never-worked.
* fnlwgt: continuous.
* education: Bachelors, Some-college, 11th, HS-grad, Prof-school, Assoc-acdm, Assoc-voc, 9th, 7th-8th, 12th, * Masters, 1st-4th, 10th, Doctorate, 5th-6th, Preschool.
* education-num: continuous.
* marital-status: Married-civ-spouse, Divorced, Never-married, Separated, Widowed, Married-spouse-absent, Married-AF-spouse.
* occupation: Tech-support, Craft-repair, Other-service, Sales, Exec-managerial, Prof-specialty, Handlers-cleaners, Machine-op-inspct, Adm-clerical, Farming-fishing, Transport-moving, Priv-house-serv, Protective-serv, Armed-Forces.
* relationship: Wife, Own-child, Husband, Not-in-family, Other-relative, Unmarried.
* race: White, Asian-Pac-Islander, Amer-Indian-Eskimo, Other, Black.
* sex: Female, Male.
* capital-gain: continuous.
* capital-loss: continuous.
* hours-per-week: continuous.
* native-country: United-States, Cambodia, England, Puerto-Rico, Canada, Germany, Outlying-US(Guam-USVI-etc), India, Japan, Greece, South, China, Cuba, Iran, Honduras, Philippines, Italy, Poland, Jamaica, Vietnam, Mexico, Portugal, Ireland, France, Dominican-Republic, Laos, Ecuador, Taiwan, Haiti, Columbia, Hungary, Guatemala, Nicaragua, Scotland, Thailand, Yugoslavia, El-Salvador, Trinadad&Tobago, Peru, Hong, Holand-Netherlands.
* salary: >50K,<=50K

## Проведите анализ данных при помощи Pandas выполнив поставленные задачи.
####

In [2]:
import pandas as pd

In [3]:
# загружаем датасет
data = pd.read_csv("./data/adult.data.csv")
data.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

**1. Посчитайте, сколько мужчин и женщин (признак *sex*) представлено в этом датасете**

In [5]:
data["sex"].count()

32561

**2. Каков средний возраст мужчин (признак *age*) по всему датасету?**

In [84]:
data[data.sex == "Male"]['age'].mean()

39.43354749885268

**3. Какова доля граждан Соединенных Штатов (признак *native-country*)?**

In [74]:
len(data[data['native-country'] == 'United-States']) * 100 / len(data['native-country'])

89.5857006848684

**4-5. Рассчитайте среднее значение и среднеквадратичное отклонение возраста тех, кто получает более 50K в год (признак *salary*) и тех, кто получает менее 50K в год**

In [221]:
m = data[data.salary == ">50K"]['age'].mean()
s = data[data.salary == ">50K"]['age'].std()
print(f"Salary > 50K:\nmean - {m}\nstd - {s}")

m = data[data.salary == "<=50K"]['age'].mean()
s = data[data.salary == "<=50K"]['age'].std()
print(f"\nSalary <= 50K:\nmean - {m}\nstd - {s}")

Salary > 50K:
mean - 44.24984058155847
std - 10.51902771985177

Salary <= 50K:
mean - 36.78373786407767
std - 14.020088490824813

**6. Правда ли, что люди, которые получают больше 50k, имеют минимум высшее образование? (признак *education – Bachelors, Prof-school, Assoc-acdm, Assoc-voc, Masters* или *Doctorate*)**

In [169]:
data[data.salary == ">50K"]['education'].all() in ['Bachelors', 'Prof-school', 'Assoc-acdm', 'Assoc-voc', 'Masters', 'Doctorate']

RangeIndex(start=0, stop=32561, step=1)

**7. Выведите статистику возраста для каждой расы (признак *race*) и каждого пола. Используйте *groupby* и *describe*. Найдите таким образом максимальный возраст мужчин расы *Asian-Pac-Islander*.**

In [186]:
s = data.groupby(['race', 'sex'])['age'].describe()
s[(s.index.get_level_values('race') == 'Amer-Indian-Eskimo') & (s.index.get_level_values('sex') == 'Male')]['max']

race                sex
Amer-Indian-Eskimo  Male    82.0
Name: max, dtype: float64

**8. Среди кого больше доля зарабатывающих много (>50K): среди женатых или холостых мужчин (признак *marital-status*)? Женатыми считаем тех, у кого *marital-status* начинается с *Married* (Married-civ-spouse, Married-spouse-absent или Married-AF-spouse), остальных считаем холостыми.**

In [206]:
maried_male = data[(data["marital-status"].str.contains("Married")) & (data["sex"] == "Male")]
single_male = data[(~data["marital-status"].str.contains("Married")) & (data["sex"] == "Male")]

maried_male_size = len(maried_male[maried_male.salary == ">50K"])
single_male_size = len(single_male[single_male.salary == ">50K"])

print(maried_male_size)
print(single_male_size)

if maried_male_size > single_male_size:
    print("Больше зарабатывают maried_male_size")
else:
    print("Больше зарабатывают single_male_size")

5965
697
Больше зарабатывают maried_male_size

**9. Какое максимальное число часов человек работает в неделю (признак *hours-per-week*)? Сколько людей работают такое количество часов и каков среди них процент зарабатывающих много?**

In [217]:
max_duration = data['hours-per-week'].max()
people_max_duration = len(data[data['hours-per-week'] == max_duration])
rich_people_max_duration = len(data[(data['hours-per-week'] == max_duration) 
                                    & (data['salary'] == ">50K")]) * 100 / people_max_duration
print(f"Максимальное число часов: {max_duration}")
print(f"Люди работающие такое количество часов: {people_max_duration}")
print(f"Процент людей работающие такое количество часов и зарабатывающих много: {rich_people_max_duration}")

Максимальное число часов: 99
Люди работающие такое количество часов: 85
Процент людей работающие такое количество часов и зарабатывающих много: 29.41176470588235

**10. Посчитайте среднее время работы (*hours-per-week*) зарабатывающих мало и много (*salary*) для каждой страны (*native-country*).**

In [7]:
data.pivot_table(index=['native-country'], columns=['salary'], values='hours-per-week', aggfunc='mean')

salary                          <=50K       >50K
native-country
?                           40.164760  45.547945
Cambodia                    41.416667  40.000000
Canada                      37.914634  45.641026
China                       37.381818  38.900000
Columbia                    38.684211  50.000000
Cuba                        37.985714  42.440000
Dominican-Republic          42.338235  47.000000
Ecuador                     38.041667  48.750000
El-Salvador                 36.030928  45.000000
England                     40.483333  44.533333
France                      41.058824  50.750000
Germany                     39.139785  44.977273
Greece                      41.809524  50.625000
Guatemala                   39.360656  36.666667
Haiti                       36.325000  42.750000
Holand-Netherlands          40.000000        NaN
Honduras                    34.333333  60.000000
Hong                        39.142857  45.000000
Hungary                     31.300000  50.000000
India                       38.233333  46.475000
Iran                        41.440000  47.500000
Ireland                     40.947368  48.000000
Italy                       39.625000  45.400000
Jamaica                     38.239437  41.100000
Japan                       41.000000  47.958333
Laos                        40.375000  40.000000
Mexico                      40.003279  46.575758
Nicaragua                   36.093750  37.500000
Outlying-US(Guam-USVI-etc)  41.857143        NaN
Peru                        35.068966  40.000000
Philippines                 38.065693  43.032787
Poland                      38.166667  39.000000
Portugal                    41.939394  41.500000
Puerto-Rico                 38.470588  39.416667
Scotland                    39.444444  46.666667
South                       40.156250  51.437500
Taiwan                      33.774194  46.800000
Thailand                    42.866667  58.333333
Trinadad&Tobago             37.058824  40.000000
United-States               38.799127  45.505369
Vietnam                     37.193548  39.200000
Yugoslavia                  41.600000  49.500000

**11.Сгруппируйте людей по возрастным группам *young*, *adult*, *retiree*, где:**
* *young* соответствует 16-35 лет
* *adult* - 35-70 лет
* *retiree* - 70-100 лет

**Проставьте название соответсвтуещей группы для каждого человека в новой колонке AgeGroup**

In [19]:
def group_by_age(x):
    if (x >= 16) & (x <35):
        return 'young'
    elif (x >= 35) & (x <70):
        return 'adult'
    elif (x >= 70) & (x <=100):
        return 'retiree'
        
data["AgeGroup"] = data.apply(lambda x: group_by_age(x['age']), axis =  1)
data.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary,AgeGroup
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K,adult
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K,adult
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K,adult
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K,adult
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K,young

**12-13. Определите количество зарабатывающих >50K в каждой из возрастных групп (колонка AgeGroup), а также выведите название возрастной группы, в которой чаще зарабатывают больше 50К (>50K)**

In [164]:
a = data.pivot_table(index=['AgeGroup'], columns=['salary'], values='age', aggfunc='count')
print(a)
a.index[a['>50K'] == a['>50K'].max()].tolist()

salary    <=50K  >50K
AgeGroup
adult     11643  6240
retiree     516   113
young     12561  1488

['adult']

**14. Сгруппируйте людей по типу занятости (колонка occupation) и определите количество людей в каждой группе. После чего напишите функциюю фильтрации filter_func, которая будет возвращать только те группы, в которых средний возраст (колонка age) не больше 40 и в которых все работники отрабатывают более 5 часов в неделю (колонка hours-per-week)**

In [172]:
def filter_func(data):
    return d.filter(lambda x: (x['age'].mean() <= 40) & (x['hours-per-week'] > 5).all())

d = data[['occupation','age', 'hours-per-week']].groupby('occupation')
print(d['occupation'].count())
filter_func(d)

occupation
?                    1843
Adm-clerical         3770
Armed-Forces            9
Craft-repair         4099
Exec-managerial      4066
Farming-fishing       994
Handlers-cleaners    1370
Machine-op-inspct    2002
Other-service        3295
Priv-house-serv       149
Prof-specialty       4140
Protective-serv       649
Sales                3650
Tech-support          928
Transport-moving     1597
Name: occupation, dtype: int64

         occupation  age  hours-per-week
442    Armed-Forces   24              40
1300   Armed-Forces   29              60
14613  Armed-Forces   39              50
16111  Armed-Forces   24              40
18034  Armed-Forces   34              40
18644  Armed-Forces   23              40
18769  Armed-Forces   30              48
25799  Armed-Forces   46              40
32316  Armed-Forces   23               8